In [47]:
df1 = make_df('AB', [0, 1])
df2 = make_df('CB', [0, 1]) #CD, CB 로 바꿔서 확인, []값 바꿔서 확인 
display('df1', 'df2', 'pd.concat([df1, df2],axis=0,join="inner")') #축 추가시 일어나는거 확인, join추가시 확인

df1
    A   B
0  A0  B0
1  A1  B1

df2
    C   B
0  C0  B0
1  C1  B1

pd.concat([df1, df2],axis=0,join="inner")
    B
0  B0
1  B1
0  B0
1  B1

df1 = make_df('AB', [0, 1])
df2 = make_df('CB', [0, 1]) #CD, CB 로 바꿔서 확인, []값 바꿔서 확인 
display('df1', 'df2', 'pd.concat([df1, df2],axis=0,join="inner",verify_integrity=True)') #디폴트 값 바꾸면 밸류에러

#The append() method

In [50]:
df1.append(df2)
df1

    A   B
0  A0  B0
1  A1  B1

In [53]:
a=[1,2,3]
b=3
print(a)
a.append(b)
print(a)

[1, 2, 3]
[1, 2, 3, 3]

In [54]:
a=pd.Series([1,2,3])
b=pd.Series([4,5,6])
c=pd.Series([7,8,9])
pd.concat([a,b,c],axis=1)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [59]:
a=[1,2,3]
b=[4,5,6]
c=[7,8,9]
np.c_[a,b,c] #한 다음 데이터프레임 만들기
np.r_[a,b,c]
pd.DataFrame(np.c_[a,b,c])

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

3-7
#Combining Datasets: Merge and Join

In [60]:
#Categories of Joins

In [95]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [75]:
#같이 있지 않은 데이터를 조인하기
#인덱스 기준으로 콘켓
#pd.concat([df1,df2])
#df1.rename({"employee":"employee1"},inplace=True,axis=1)
#df1
#pd.concat([df1,df2],axis=1)
df1.set_index("employee",inplace=True)
df2.set_index("employee",inplace=True)
df3=pd.concat([df1,df2],axis=1)
df3.reset_index() ###

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [77]:
pd.merge(df1,df2) #머지의 특성: 같음 키가 있으면 쓰겠다

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [83]:
#머지에서 키를 바꾸면
df1.rename({"employee":"employee1"},axis=1,inplace=True)
#Specification of the Merge Key
pd.merge(df1,df2,left_on="employee1",right_on="employee") #키가 같은 값끼리 가져옴
pd.merge(df1,df2,left_on="employee1",right_on="employee").drop("employee1",axis=1)
pd.merge(df1,df2,left_on="employee1",right_on="employee").drop("employee1",axis=1)[["employee","group","hire_date"]]

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [92]:
#The left_index and right_index keywords
df1a=df1.set_index(df1.employee1)
df1a
df1a=df1.set_index("employee1")
df1a

df2a=df2.set_index("employee")
pd.merge(df1a,df2a,left_index=True,right_index=True).reset_index()

  index        group  hire_date
0   Bob   Accounting       2008
1  Jake  Engineering       2012
2  Lisa  Engineering       2004
3   Sue           HR       2014

In [97]:
df1a.join(df2a)
#df1a

                 group  hire_date
employee1
Bob         Accounting       2008
Jake       Engineering       2012
Lisa       Engineering       2004
Sue                 HR       2014

In [104]:
#Specifying Set Arithmetic for Joins
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display('df6', 'df7', 'pd.merge(df6, df7, how="outer")') #outer join추가 (디폴트)
display('df6', 'df7', 'pd.merge(df6, df7, how="left")')
display('df6', 'df7', 'pd.merge(df7, df6, how="right")') 
display('df6', 'df7', 'pd.merge(df6, df7, how="inner")') #우리가 하는 조인

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how="inner")
   name   food drink
0  Mary  bread  wine

In [110]:
#Overlapping Column Names: The suffixes Keyword
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4],
                   'group':['A','A','B','B']}) #키추가
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2],
                   'group':['A','B','A','B']})
#display('df8', 'df9', 'pd.merge(df8, df9, on="name")')
print(df8)
print("=================\n\n")
print(df9)

   name  rank group
0   Bob     1     A
1  Jake     2     A
2  Lisa     3     B
3   Sue     4     B
=================


   name  rank group
0   Bob     3     A
1  Jake     1     B
2  Lisa     4     A
3   Sue     2     B

In [116]:
pd.merge(df8, df9, on="name")
pd.merge(df8, df9, on="rank")
pd.merge(df8, df9, on=["name","group"],how="outer",suffixes=["_X","_Y"])

   name  rank_X group  rank_Y
0   Bob     1.0     A     3.0
1  Jake     2.0     A     NaN
2  Lisa     3.0     B     NaN
3   Sue     4.0     B     2.0
4  Jake     NaN     B     1.0
5  Lisa     NaN     A     4.0

In [119]:
#Example: US States Data
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')
#print(pop)
#print(areas)
#print(abbrevs)
#display('pop.head()', 'areas.head()', 'abbrevs.head()')

In [121]:
pop.head(3) #내가 정한 갯수만큼 보여줌
areas.head(1)

     state  area (sq. mi)
0  Alabama          52423

In [140]:
#outer join
data=pd.merge(pop,abbrevs,left_on="state/region",right_on="abbreviation",how="outer")
data

data.notnull().sum()
data.isnull().sum() #비어있는 값 보기

#같은거 지우기
data.drop("abbreviation",axis=1,inplace=True)
data.head()

data.isnull().sum()

data.isnull()
data.population.isnull()
data[data["population"].isnull()] #인덱스가 들어간 loc, iloc
data[(data["state"].isnull())&(data["population"].isnull())] #동시에 null인거 가져오기 
data[data.population.isnull()]
#data[["ages","year","population"]]
data[data.population.isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [149]:
#갯수알기
data[data.population.isnull()]
data.loc[data.population.isnull(),"state/region"] #두개값 가져올때 loc, i로케이션은 위치값?
data.iloc[:,0] #인덱스써야함
#boolean값 안먹을 때 iloc을 이용해 0번 값을 가져오기: true인 값만 인덱싱
data.population.isnull()==True
data.population.isnull()[data.population.isnull()==True].index
data.iloc[[2448,2467],0]

data.iloc[data.population.isnull()[data.population.isnull()==True].index,0]

2448    PR
2449    PR
2450    PR
2451    PR
2452    PR
2453    PR
2454    PR
2455    PR
2456    PR
2457    PR
2458    PR
2459    PR
2460    PR
2461    PR
2462    PR
2463    PR
2464    PR
2465    PR
2466    PR
2467    PR
Name: state/region, dtype: object

In [151]:
data.loc[data.state.isnull(),"state/region"].unique()

array(['PR', 'USA'], dtype=object)

In [160]:
data.loc[data["state/region"] == "PR", ["state/region","state"]]
data.loc[data["state/region"] == "PR", "state"] = "Puerto Rico"
data.loc[data["state/region"] == "PR", "state"]

data.loc[data["state/region"] == "USA", "state"]="United States"

len(data.loc[data.state.isnull()])

0

In [196]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')

pop.head(1)
abbrevs.head(1)

df=pd.merge(pop,abbrevs,left_on="state/region",right_on="abbreviation",how="outer")
df.head(1)
df.drop("abbreviation",axis=1,inplace=True) #컬럼 또는 로우 드롭: 축 줘야함
df.head(1)

df=df[["state","state/region","ages","year","population"]]
df.rename({"state/region":"region"},axis=1,inplace=True)
df.head(1)

df.isnull().sum() #행별 빈값 합

state         96
region         0
ages           0
year           0
population    20
dtype: int64

In [197]:
df.loc[df.state.isnull(),"region"].unique()

array(['PR', 'USA'], dtype=object)

In [198]:
#PR="Puert rico"
#USA="United States"

state=np.where(df.state.notnull(), df.state,
               np.where(df.region=="PR", "Puert rico","United States"))
state
#df["new_state"]=state
#df.drop("new_state",axis=1,inplace=True)
df["new_state"]=state
df

#df.drop(["new_region","state"],axis=1,inplace=True)
df.drop("state",axis=1,inplace=True)
df
df.rename({"new_state":"state"},axis=1,inplace=True)
df.head(1)

  region     ages  year  population    state
0     AL  under18  2012   1117489.0  Alabama

In [200]:
areas.head(1)
df.loc[df.state=="Puert rico","state"]="Puerto Rico"

new_df=pd.merge(df.areas,on="state",how="outer")
new_df.head(1)
new_df.isnull().sum()
new_df[new_df.region.isnull()]
new_df

AttributeError: 'DataFrame' object has no attribute 'areas'

In [204]:
new_df.year.unique()
new_df.ages.unique()
len(new_df.loc[(new_df.ages=="total")&(new_df.year==2012),:])
len(new_df.dtypes("ages=='total'&year==2012"))

stmt="ages=='total'&year==2012"
len(new_df.query(stmt))

NameError: name 'new_df' is not defined

In [ ]:
new_df.isnull().sum()
new_df.dropna().region.size
new_df.region.size-new_df.dropna().region.size
new_df.isnull.sum()
new_df.columns[-1]
density=new_df.population/new_df["area (sq. mi)"] #.이 있어서 그냥 안나누고 이렇게 나눔
density=new_df.population/new_df[new_df.columns[-1]] #다시 쓴거
pd.concat([new_df,density]) #NaN이 생겼다. 아까 날린게 있어서. 
pd.concat([new_df,density],axis=1)
new_df

new_df["density"]=density
density.sort_values(ascending=True)
density.sort_values(ascending=False) #오름차순

In [ ]:
## 실기시험: 인구밀도가 가장 높았던 년도의 주는 어느곳 인가?
## 년도, 주, 인구밀도
#힌트: sort, head(1)
new_df.density.sort_values(ascending=False)

#sort value 없이 가져오기
new_df.loc[new_df.density == new_df.density.max(),["year","state","density"]]
new_df.loc[[391],["year","state","density"]] #위랑 같음

#sort value 써서 가져오기
new_df.loc[new_df.sort_values(ascending=False).index,["year","state","density"]]
new_df.loc[new_df.sort_values(ascending=False).index,["year","state","density"]].head() #맥스 값 나옴
new_df.loc[new_df.sort_values(ascending=False).index,["year","state","density"]].head(5).tail(1) #5번째 값만 
new_df.loc[new_df.sort_values(ascending=False).index,["year","state","density"]][:5].tail(1)

In [207]:
###3-8 
#Aggregation and Grouping

In [211]:
import numpy as np
import pandas as pd

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [213]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

URLError: <urlopen error [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: certificate is not yet valid (_ssl.c:1129)>

In [214]:
#Simple Aggregation in Pandas
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
narray=rng.rand(5)
print(ser)
print(narray)

In [ ]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df
df.sum(axis=1) #횡방향 합 
df.values.sum(axis=0)
#까지 비교

In [ ]:
#다 보여주는거
planets.describe() #프레임 iloc
planets.dtypes
planets.method.describe()
planets.number.describe() #시리즈 
#NaN날리기
planets.isnull().sum()
cl_planets=planets.dropna().describe() #완전날리기
cl_planets.number.count()
cl_planets.number.head(1)

In [ ]:
#GroupBy: Split, Apply, Combine
new_df.loc[new_df.region=="AL","population"].mean()
new_df.loc[new_df.region=="PR","population"].mean()

region_mean={} #딕셔너리로 만들기
for i in new_df.region.unique():
    region_mean[i]=new_df.loc[new_df.region==i,"population"].mean()
pd.Series(region_mean)#시리즈로 만들기

new_df.groupby("region").mean().population
new_df.groupby("region").mean()
new_df.groupby("region").count()

new_df.year.unique().size
new_df.region.unique().size
new_df.gropby(["year","region"]).sum()
new_df.gropby(["year","region"]).std()
new_df.gropby(["year","region"]).count()

planets.groupby('method')['orbital_period'].mean()
planets.groupby('method')['orbital_period'].mean().orbital_period

#Dispatch methods
planets.groupby('method')['year'].describe() #요약정보 한번에 가져오기
planets.groupby('method')['year'].aggregate(["mean","sum","std","count"]) #한꺼번에 보기
planets.groupby('method')['year'].aggregate(["mean","sum","std","count"]).number

In [233]:
#Aggregate, filter, transform, apply
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df


def filter_func(x):
    return x['data2'].std() > 4

display('df', "df.groupby('key').std()", "df.groupby('key').filter(filter_func)")
#함수 없이 세번째 프레임 만들어 보기
#df[df.groupby('key').data2.std()]
df[df.key.isin(df.groupby("key").data2.std()[(df.groupby("key").data2.std()>4)].index)] #키 b,c값만 뽑아오기
df.groupby('key').filter(lambda x: x['data2'].std()>4)
#display

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [236]:
#각 a값들의 평균을 구하고 빼기
df
-new_df[new_df.region=="AL"].population.mean()

#pop평균 구한다음 각pop빼기

NameError: name 'new_df' is not defined

In [ ]:
rng=np.random.RandomState(10)
height=rng.randint(60,100,size=100)
species=rng.randint(1,size=100)
species=np.where(species==0,"dog","cat")
dic={"species":species,
     "height":height}
df=pd.DataFrame(dic)
df.head()
df.groupby("species").describe()

#dog의 키에서 키의 평균보다 큰 데이터만 추출
#종별로 평균을 구해서 종별로 구한 평균을 뺀 값의 데이터를 만들기
df[df.species=="dog"].mean() #dog평균
df[df.height>df[df.species=="dog"].mean().values[0]]
df.species.unique().size
df.groupby("species").count().index.size

#고양이와 강아지 편균을 구행
df[df.species=="dog"]=df[df.species=="dog"] - df.species[df.species=="dog"].mean()
df[df.species=="cat"]=df[df.species=="cat"] - df.species[df.species=="cat"].mean()

df.groupby("species").transform(Lambda x: x-x.mean()) #종별평균

for i in df.species.unique():
    df.loc[df.species==i,"height"]=df.loc[df.species==i,"height"]- df.loc[df.species==i,"height"].mean()
i
df1

In [241]:
#The apply() method
#apply func 개념
x=rng.randint(100,size=100)
df=pd.DataFrame(x.reshape(20,5))
x
df.head()
df.apply(max,axis=1)
df.columns=["a","b","c","d","e"]
df.apply(max,axis=1)


df.iloc[[0],:].argmax()
def get_name(x):
    return df.columns[x.argmax()]
get_name(df.iloc[0,:])
df.apply(lambda x: df.columns[x.argmax()] ,axis=1)

0     87
1     94
2     73
3     70
4     89
5     99
6     89
7     56
8     87
9     97
10    86
11    83
12    81
13    80
14    94
15    70
16    91
17    98
18    58
19    99
dtype: int64

In [242]:
new_df
new_df.set_index("ages",inplace=True)

grouped={"under18":"18세미만","total":"전체"}
new_df.groupby(grouped).mean()

NameError: name 'new_df' is not defined

In [ ]:
planets=sns.load_dataset("planets")
x=(planets.year//10)*10 #10년단위로 묶어서 
y=planets.method
planets.groupby([x,y]).mean()

###3-9

In [268]:
month=np.array(list(range(1,13))*10)
amount=np.random.randint(0,100,size=month.size)

df=pd.DataFrame(np.c_[month,amount],columns=["month","amount"])
df

df.groupby("month").sum()
df.head(2)

name=np.random.choice(np.array(['A','B','C']),size=month.size)
df["name"]=name
df

df.groupby(["month","name"]).sum() #집합aggregation
df.head(2)

#피봇테이블 만들기: 어느게 인덱스, 컬럼 되느냐 , 어떻게 밸류값을 지정하느냐 
df.pivot_table("amount",index="month",columns="name").reset_index()
df.pivot_table("amount",index="name",columns="month").reset_index()

month,name,1,2,3,4,5,6,7,8,9,10,11,12
0,A,39.5,58.000000,54.25,56.000000,54.666667,28.000000,3.00,41.666667,38.000000,48.2,29.25,67.000000
1,B,53.0,83.000000,NaN,79.666667,67.500000,13.000000,54.25,59.000000,48.166667,65.4,26.75,69.333333
2,C,43.8,82.333333,66.00,51.000000,68.600000,65.428571,44.20,56.333333,60.333333,NaN,94.50,35.750000